accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_СоответствиеОбъектовДляОбмена/МС_СоответствиеОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_СоответствиеОбъектовДляОбмена</name>
  <resources>
    <name>ИмяТипаПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СобственнаяСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаВДругойИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bb44a57a-ce46-4995-a057-b7b6c4ccc2e5">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f0fa334c-59dc-4b6c-b81c-1bbad6b45917">
    <name>НДС22</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ca0cf7c1-ce04-4fe1-9fe5-0f0e1099a0ff">
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76f269ef-8d75-4355-955b-0d83af4b6513">
    <name>НДС18_118</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2567b477-58ec-4a0b-9a24-fbb80983c5a7">
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be1ca97f-f42c-40f1-a0f8-786f02ce1174">
    <name>НДС10_110</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92f1bd28-d028-4c77-8678-600da9b8a9a5">
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="df613792-69af-43d1-ad77-47226fbc178c">
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="45974ccb-45ed-4235-b8ff-abc37bb5c45b">
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6cf8ca3a-63dd-4385-ba30-38011e461f36">
    <name>НДС20_120</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9e148ea-d7b7-4295-8b0a-52c32dba3de9">
    <name>НДС5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fd01d596-2c9d-4ea0-9473-d151dc6d0656">
    <name>НДС5_105</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="afbae5cd-5d55-4639-b461-c68d385ec5fb">
    <name>НДС7</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="89643718-2e98-4667-bb58-9476b4a8bfab">
    <name>НДС7_107</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f0456ccc-4e50-4999-b74b-8ac9c206b7f4">
    <name>НДС22_122</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

accstarkam.ОбменМагистральБП/src/Enums/СпособыЗачетаАвансов/СпособыЗачетаАвансов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bd467ec-bda2-4892-88fe-81b6bd2acdf3">
  <name>СпособыЗачетаАвансов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e23f9964-6487-4a73-af8e-d5ea01b5ffb9">
    <name>НеЗачитывать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

accstarkam.ОбменМагистральБП/src/HTTPServices/МС_HTTPЗагрузкаИзРозницыНеИспользовать/Module.bsl
#Область ОбработчикиСобытий

Функция ПриемПоступленияТоваровУслугИзРозницы(Запрос)
	возврат 0;
	
	Попытка
		
		Данные = Неопределено;
		
		Если Запрос.HTTPМетод <> "POST" Тогда
			Возврат ОтветJSON(405, Новый Структура("success,error", Ложь, "Разрешен только POST"));
		КонецЕсли;
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если ПустаяСтрока(ТелоЗапроса) Тогда
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, "Пустое тело запроса"));
		КонецЕсли;
		
		Попытка
			Данные = ПрочитатьJSONИзСтроки(ТелоЗапроса);
		Исключение
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, "Некорректный JSON: " + ОписаниеОшибки()));
		КонецПопытки;
		
		СообщениеОбОшибке = "";
		Если Не ПроверитьВходящийJSON(Данные, СообщениеОбОшибке) Тогда
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, СообщениеОбОшибке));
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ЗаблокироватьЗагрузкуПоGUID(Данные.guid);
			Если Данные.source =  "ПриходнаяНакладная" Тогда
				Результат = СоздатьПоступлениеТоваровУслугИзРозницы(Данные);
			ИначеЕсли Данные.source =  "СчетНаОплатуПоставщика" Тогда
				Результат = СоздатьСчетНаОплатуПоставщикаИзРозницы(Данные);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_ОбменРозницаБП",
			УровеньЖурналаРегистрации.Информация,
			,
			,
			"Загрузка поступления из Розницы завершена (guid=" + Строка(Данные.guid)
				+ ", created=" + ?(Результат.created, "true", "false")
				+ ", ref=" + Строка(Результат.document_ref)
				+ ", number=" + Строка(Результат.document_number) + ")."
		);
		
		Возврат ОтветJSON(200, Результат);
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_ОбменРозницаБП",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Ошибка загрузки поступления из Розницы (guid=" + ?(Данные = Неопределено Или Данные = Null, "?", Строка(ЗначениеСвойства(Данные, "guid", "?"))) + "): " + ОписаниеОшибки()
		);
		
		Возврат ОтветJSON(
			500,
			Новый Структура(
				"success,error",
				Ложь,
				ОписаниеОшибки()
			)
		);
		
	КонецПопытки;
КонецФункции


Функция НоменклатураЗагрузитьНоменклатуру(Запрос)
	
	Возврат 0;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтветJSON(КодСостояния, Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Функция ЭтоНезаполненнаяСтрока(Знач Значение)
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ПустаяСтрока(СокрЛП(Строка(Значение)));
КонецФункции

Функция ЗначениеСвойства(Данные, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	Если Данные = Неопределено Или Данные = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Если Данные.Свойство(ИмяСвойства) Тогда
		Возврат Данные[ИмяСвойства];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПроверитьВходящийJSON(Данные, СообщениеОбОшибке)
	
	СообщениеОбОшибке = "";
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		СообщениеОбОшибке = "Ожидается JSON-объект верхнего уровня.";
		Возврат Ложь;
	КонецЕсли;
	
	GUIDДокументаИсточник = ЗначениеСвойства(Данные, "guid", "");
	Если ЭтоНезаполненнаяСтрока(GUIDДокументаИсточник) Тогда
		СообщениеОбОшибке = "Не заполнено поле guid.";
		Возврат Ложь;
	КонецЕсли;
	
	Организация = ЗначениеСвойства(Данные, "organization", Неопределено);
	Если ТипЗнч(Организация) <> Тип("Структура") Тогда
		СообщениеОбОшибке = "Не заполнено поле organization.";
		Возврат Ложь;
	КонецЕсли;
	
	Товары = ЗначениеСвойства(Данные, "items", Неопределено);
	Если ТипЗнч(Товары) <> Тип("Массив") Тогда
		СообщениеОбОшибке = "Не заполнено поле items (ожидается массив).";
		Возврат Ложь;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		СообщениеОбОшибке = "Поле items пустое.";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаблокироватьЗагрузкуПоGUID(Знач GUIDДокумента)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.МС_СоответствиеОбъектовДляОбмена");
	ЭлементБлокировкиДанных.УстановитьЗначение("СсылкаВДругойИБ", GUIDДокумента);
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_ОбменРозницаБП",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Ошибка блокировки загрузки по GUID=" + Строка(GUIDДокумента) + ": " + ОписаниеОшибки()
		);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПрочитатьJSONИзСтроки(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция ДатаИзСтрокиJSON(Знач ЗначениеJSON) 
	
	Если ЗначениеJSON = Неопределено Или ЗначениеJSON = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеJSON) = Тип("Дата") Тогда
		Возврат ЗначениеJSON;
	КонецЕсли;
	
	СтрокаДаты = СокрЛП(Строка(ЗначениеJSON));
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат XMLЗначение(Тип("Дата"), СтрокаДаты);

КонецФункции

Функция ПолучитьПустуюСсылкуПоТипу(ТипСсылки) 
	
	ИмяТипа = Строка(ТипСсылки);
	
	Если СтрНачинаетсяС(ИмяТипа, "СправочникСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
		Возврат Справочники[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИмяТипа, "ДокументСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "ДокументСсылка.", "");
		Возврат Документы[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	ВызватьИсключение "Неподдерживаемый тип ссылки: " + ИмяТипа;
	
КонецФункции

Функция СоздатьНовыйОбъектПоТипу(ТипСсылки) 
	
	ИмяТипа = Строка(ТипСсылки);
	
	Если СтрНачинаетсяС(ИмяТипа, "СправочникСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
		Возврат Справочники[ИмяОбъекта].СоздатьЭлемент();
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИмяТипа, "ДокументСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "ДокументСсылка.", "");
		Возврат Документы[ИмяОбъекта].СоздатьДокумент();
	КонецЕсли;
	
	ВызватьИсключение "Неподдерживаемый тип ссылки: " + ИмяТипа;
	
КонецФункции

Функция НайтиПоСсылкеВДругойБазе(СсылкаВДругойИБ, ИмяТипаПриемника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МС_СоответствиеОбъектовДляОбмена.СобственнаяСсылка КАК СобственнаяСсылка
	|ИЗ
	|	РегистрСведений.МС_СоответствиеОбъектовДляОбмена КАК МС_СоответствиеОбъектовДляОбмена
	|ГДЕ
	|	МС_СоответствиеОбъектовДляОбмена.СсылкаВДругойИБ = &СсылкаВДругойИБ
	|	И МС_СоответствиеОбъектовДляОбмена.ИмяТипаПриемника = &ИмяТипаПриемника";
	
	Запрос.УстановитьПараметр("СсылкаВДругойИБ", СсылкаВДругойИБ);
	Запрос.УстановитьПараметр("ИмяТипаПриемника", ИмяТипаПриемника);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СобственнаяСсылка;
	КонецЕсли;
	
	Возврат ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника);
	
КонецФункции 

Функция НайтиПоИННКПП(ИНН, КПП, ИмяТипа)
    	
	ИНН = СокрЛП(ИНН);
	КПП = СокрЛП(КПП);
	
	ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
	
	Если ПустаяСтрока(ИНН) Тогда
		Возврат Справочники[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	ВЫБОР
	|		КОГДА Организации.КПП = &КПП
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник." + ИмяОбъекта + " КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И Организации.ИНН = &ИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники[ИмяОбъекта].ПустаяСсылка();

КонецФункции 

Функция НайтиОрганизацию(Данные)
	
	ИмяТипаПриемника = "СправочникСсылка.Организации";
	Организация = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	Если Организация = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		Организация = НайтиПоИННКПП(Данные.inn, Данные.kpp, ИмяТипаПриемника);
		ЗаписатьВРегистрСоответствияОбъектов(Организация, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Возврат Организация;	
	
КонецФункции

Функция НайтиКонтрагента(Данные)
	
	ИмяТипаПриемника = "СправочникСсылка.Контрагенты";
	Контрагент = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	Если Контрагент = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		Контрагент = НайтиПоИННКПП(Данные.inn, Данные.kpp, ИмяТипаПриемника);
		ЗаписатьВРегистрСоответствияОбъектов(Контрагент, Данные.guid, ИмяТипаПриемника);
	КонецЕсли; 
	
	Возврат Контрагент;
	
КонецФункции 

Функция НайтиСклад(ДанныеСклада)
	//Склад.Вставить("guid", ГУИД(ДокументСсылка.СтруктурнаяЕдиница));
	//Склад.Вставить("name", ДокументСсылка.СтруктурнаяЕдиница.Наименование);
	
	СкладПоУмолчанию = Константы.МС_СкладПоУмолчаниюДляЗагрузкиИзРозницы.Получить();
	Если ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
		Возврат СкладПоУмолчанию;
	КонецЕсли;
	
	Возврат XMLЗначение(Тип("СправочникСсылка.Склады"), "f2bbcd91-6b13-11e4-8756-000c29b3b732"); // fallback, Склад ЦМС
	
КонецФункции // ()

Процедура ЗаполнитьДоговор(ДокументОбъект)

	МассивВидовДоговоров = РаботаСДоговорамиКонтрагентовБПВызовСервера.ВидыДоговоровДокумента(
		Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары, ); //ДокументОбъект.ВидОперации//Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
	ДокументОбъект.Контрагент, ДокументОбъект.Организация, МассивВидовДоговоров);	
	
КонецПроцедуры

Функция НайтиНоменклатуру(Данные)
	Если ЗначениеЗаполнено(Данные.guid_bp) Тогда
		Попытка
			Возврат XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Данные.guid_bp)
		Исключение      
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"МС_ОбменРозницаБП",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Ошибка поиска номенклатуры по guid_bp=" + Строка(Данные.guid_bp) + ": " + ОписаниеОшибки()
			);
		КонецПопытки
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДССтрока)
	Если СтавкаНДССтрока = "22%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС22;
	ИначеЕсли СтавкаНДССтрока = "22% / 122%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС22_122;
	ИначеЕсли СтавкаНДССтрока = "5%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС5;
	ИначеЕсли СтавкаНДССтрока = "5% / 105%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС5_105;
	ИначеЕсли СтавкаНДССтрока = "20%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДССтрока = "18%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДССтрока = "18% / 118%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДССтрока = "10%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли СтавкаНДССтрока = "10% / 110%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли СтавкаНДССтрока = "0%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли СтавкаНДССтрока = "Без НДС" Тогда	
		Возврат Перечисления.СтавкиНДС.БезНДС;
	ИначеЕсли СтавкаНДССтрока = "7%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС7;
	ИначеЕсли СтавкаНДССтрока = "7% / 107%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС7_107;
	Иначе
		Возврат Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьТовары(Товары, Данные)
	Товары.Очистить();
	
	Для каждого СтрокаТЧ Из Данные Цикл 
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = НайтиНоменклатуру(СтрокаТЧ.Nomenclature);
		НоваяСтрока.Количество = СтрокаТЧ.quantity;
		НоваяСтрока.Цена = СтрокаТЧ.price;
		НоваяСтрока.Сумма = СтрокаТЧ.amount;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТЧ.vat_rate);
		НоваяСтрока.СуммаНДС = СтрокаТЧ.vat_amount;
		
		НоваяСтрока.СтранаПроисхождения = НоваяСтрока.Номенклатура.СтранаПроисхождения;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьТоварыСчетНаОплатуПоставщика(Товары, Данные)
	Товары.Очистить();
	
	Для каждого СтрокаТЧ Из Данные Цикл 
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = НайтиНоменклатуру(СтрокаТЧ.Nomenclature);
		НоваяСтрока.Количество = СтрокаТЧ.quantity;
		НоваяСтрока.Цена = СтрокаТЧ.price;
		НоваяСтрока.Сумма = СтрокаТЧ.amount;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТЧ.vat_rate);
		НоваяСтрока.СуммаНДС = СтрокаТЧ.vat_amount;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументДаннымиИзРозницы(ДокументОбъект, Данные)
	
	ДокументОбъект.Организация	= НайтиОрганизацию(Данные.organization);
	ДокументОбъект.Контрагент	= НайтиКонтрагента(Данные.Counterparty);
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, , Истина);
	
	ЗаполнитьДоговор(ДокументОбъект);
	
	ДокументОбъект.Дата = ДатаИзСтрокиJSON(Данные.date); 
	ДокументОбъект.ДатаВходящегоДокумента = ДатаИзСтрокиJSON(Данные.incoming_date); 
	ДокументОбъект.Склад = НайтиСклад(Данные.warehouse);
	ДокументОбъект.НомерВходящегоДокумента = Данные.incoming_number;
	ДокументОбъект.Комментарий = Данные.comment;	
	ДокументОбъект.ЭтоУниверсальныйДокумент = Данные.is_upd;
	ДокументОбъект.СуммаВключаетНДС = Данные.amount_includes_vat;
	ДокументОбъект.СуммаДокумента = Данные.total_amount;
	ДокументОбъект.ЕстьМаркируемаяПродукцияГИСМ = Данные.GISM;
	ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	
	ЗаполнитьТабличнуюЧастьТовары(ДокументОбъект.Товары, Данные.items);
	
КонецПроцедуры

Процедура ЗаполнитьСчетНаОплатуПоставщикаДаннымиИзРозницы(ДокументОбъект, Данные)
	
	ДокументОбъект.Организация	= НайтиОрганизацию(Данные.organization);
	ДокументОбъект.Контрагент	= НайтиКонтрагента(Данные.Counterparty);
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект);
	
	ЗаполнитьДоговор(ДокументОбъект);
	
	ДокументОбъект.Дата = ДатаИзСтрокиJSON(Данные.date); 
	ДокументОбъект.ДатаВходящегоДокумента = ДатаИзСтрокиJSON(Данные.incoming_date); 
	ДокументОбъект.НомерВходящегоДокумента = Данные.incoming_number;
	ДокументОбъект.Комментарий = Данные.comment;	
	ДокументОбъект.СуммаВключаетНДС = Данные.amount_includes_vat;
	ДокументОбъект.СуммаДокумента = Данные.total_amount;
	
	ЗаполнитьТабличнуюЧастьТоварыСчетНаОплатуПоставщика(ДокументОбъект.Товары, Данные.items);
	
КонецПроцедуры

Процедура ЗаписатьВРегистрСоответствияОбъектов(СобственнаяСсылка, СсылкаВДругойИБ, ИмяТипаПриемника)
	Если ЗначениеЗаполнено(СобственнаяСсылка) Тогда
		Запись = РегистрыСведений.МС_СоответствиеОбъектовДляОбмена.СоздатьМенеджерЗаписи();
		Запись.СобственнаяСсылка = СобственнаяСсылка;
		Запись.СсылкаВДругойИБ = СсылкаВДругойИБ;
		Запись.ИмяТипаПриемника = ИмяТипаПриемника;
		Запись.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

Функция СоздатьПоступлениеТоваровУслугИзРозницы(Данные)
	ИмяТипаПриемника = "ДокументСсылка.ПоступлениеТоваровУслуг";
	ДокументСсылка = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	ДобавитьВСоответствиеОбъектов = Ложь;
	
	Если ДокументСсылка = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		ДобавитьВСоответствиеОбъектов = Истина;
		ДокументОбъект = СоздатьНовыйОбъектПоТипу(ИмяТипаПриемника);
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьДокументДаннымиИзРозницы(ДокументОбъект, Данные); 
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, , Истина); //удалять нельзя
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если ДобавитьВСоответствиеОбъектов Тогда
		ЗаписатьВРегистрСоответствияОбъектов(ДокументОбъект.Ссылка, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("created", ДобавитьВСоответствиеОбъектов);
	Результат.Вставить("document_ref", Строка(ДокументОбъект.Ссылка));
	Результат.Вставить("document_number", ДокументОбъект.Номер);
	Результат.Вставить("message", ?(ДобавитьВСоответствиеОбъектов, "Документ Поступление товаров и услуг создан", "Документ Поступление товаров и услуг обновлен"));
	Результат.Вставить("ref", ПолучитьНавигационнуюСсылку(ДокументОбъект.Ссылка));
	Возврат Результат;
	
КонецФункции

Функция СоздатьСчетНаОплатуПоставщикаИзРозницы(Данные)
	ИмяТипаПриемника = "ДокументСсылка.СчетНаОплатуПоставщика";
	ДокументСсылка = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	ДобавитьВСоответствиеОбъектов = Ложь;
	
	Если ДокументСсылка = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		ДобавитьВСоответствиеОбъектов = Истина;
		ДокументОбъект = СоздатьНовыйОбъектПоТипу(ИмяТипаПриемника);
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьСчетНаОплатуПоставщикаДаннымиИзРозницы(ДокументОбъект, Данные); 
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект); //удалять нельзя
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если ДобавитьВСоответствиеОбъектов Тогда
		ЗаписатьВРегистрСоответствияОбъектов(ДокументОбъект.Ссылка, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("created", ДобавитьВСоответствиеОбъектов);
	Результат.Вставить("document_ref", Строка(ДокументОбъект.Ссылка));
	Результат.Вставить("document_number", ДокументОбъект.Номер);
	Результат.Вставить("message", ?(ДобавитьВСоответствиеОбъектов, "Документ Счет на оплату поставщика создан", "Документ Поступление товаров и услуг обновлен"));
	Результат.Вставить("ref", ПолучитьНавигационнуюСсылку(ДокументОбъект.Ссылка));
	Возврат Результат;
	
КонецФункции


#КонецОбласти
